<template>
  <div id="remarkContent">
    <p>一、页面布局：主页一共分为五个区域，即左侧的资源列表区、顶部的功能区、中间区域的工作区、底部的信息提示区、右侧的所使用资源区。</p>
    <p>二、资源列表区</p>
    <p class="indent2">（一）介绍：该区域展示的是用户用以创建图形化流程图的原表树形列表，原表类型主要包括数据表（业务数据表、项目数据表、个人数据表）、模型结果表、业务维度表和风险查证模型表。</p>
    <p class="indent2">（二）操作</p>
    <p class="indent4">1、用户可对树列表的表节点进行拖拽操作，将选择的表拖拽至中间区域的工作区中生成一个原表节点</p>
    <p class="indent4">2、用户可对树列表中的单个表节点进行右键【预览数据】、【关联表查询】的操作</p>
    <p class="indent4">3、用户可对树列表中的根节点进行右键【刷新】的操作</p>
    <%--<p class="indent4">3、用户可对树列表中的多个表节点进行Ctrl多选右键【合并】/【关联】操作，此时中间区域的工作区中会自动生成所选择树节点的图形（原表）和操作图形（【数据合并】/【数据关联】）</p>--%>
    <%--<p class="indent4">4、用户在搜索框内输入要搜索的内容，可对所有节点的内容进行搜索，查找符合条件的树节点，搜索精度到数据表的列</p>--%>
    <p>三、功能区</p>
    <p class="indent2">（一）介绍：该区域展示的是用户用以创建图形化流程图的处理表数据的功能节点和用以存储图形化流程图信息的功能按钮，其中功能节点包括：数据筛选、数据排序、数据抽样、数据分层、分组汇总、数据去重、数据频次分析、数据转码、SQL查询器、数据融合、数据关联，功能按钮包括：打开、分享、保存为、另存为、撤销、恢复、全部运行、帮助，以及【文件】区域的更多功能（包括图形导入、图形导出、数据导入）</p>
    <p class="indent2">（二）操作</p>
    <p class="indent4">1、功能节点：用户可对功能节点进行拖拽操作，将选择的节点拖拽至中间区域的工作区中生成一个对应图形的操作节点</p>
    <p class="indent4">2、功能按钮：</p>
    <p class="indent6">（1）新建：浏览器中打开新的图形化窗口，用户可创建新的图形化流程图</p>
    <p class="indent6">（2）打开：当前窗口中弹出小窗口选择一条图形化记录后，在浏览器中打开的新窗口中加载选择的图形化流程图，用户可在选择的流程图上继续操作</p>
    <p class="indent6">（3）保存：用户保存当前操作的图形化流程图</p>
    <p class="indent6">（4）另存为：用户可将当前操作的图形化流程图另存储一份进行保存</p>
    <p class="indent6">（5）帮助：提供给用户具体操作图形化工具的帮助说明</p>
    <p>四、工作区</p>
    <p class="indent2">（一）介绍：该区域主要是用户用以图形化流程图的设计区域，所有的流程节点都会被拖拽至此区域进行设计，流程图中只包含节点和连接线（边），当设计的流程图过多超出当前工作区的区域时，工作区会自动向右、向下进行范围的扩充。</p>
    <p class="indent2">（二）操作</p>
    <p class="indent4">1、用户可根据需要拖动节点进行位置变动</p>
    <p class="indent4">2、鼠标移动至节点上，可点击【↓】拖动至另一个节点上，进行节点间的连线操作</p>
    <p class="indent4">3、鼠标点击连接线，拖动连接线的两端拖动至另一个节点上，变更节点间的连线</p>
    <p class="indent4">4、空白区域点击鼠标右键，出现右键菜单，包括选中节点、选中连线、选中所有、撤销、粘贴功能</p>
    <p class="indent6">（1）选中节点：选中当前流程图中所有的节点</p>
    <p class="indent6">（2）选中连线：选中当前流程图中所有的连接线</p>
    <p class="indent6">（3）选择所有：选中当前流程图中所有的节点和连接线</p>
    <p class="indent6">（4）撤销：撤销用户当前步骤的操作内容</p>
    <p class="indent6">（5）粘贴：粘贴用户当前剪切或复制的操作内容</p>
    <p class="indent4">5、节点点击鼠标右键，不同类型的节点出现不同的右键菜单，总的菜单包括执行、取消执行、查看数据、最终结果输出、查询执行语句、SQL编辑、配置节点属性、重置配置、重命名、复制、剪切、删除功能。</p>
    <p class="indent6">（1）执行本节点：结果表节点特有菜单项，执行处于未执行或执行失败状态的当前结果表节点</p>
    <p class="indent6">（2）执行到本节点：结果表节点特有菜单项，执行处于未执行或执行失败状态的当前结果表节点及其前置节点</p>
    <p class="indent6">（3）取消执行：结果表节点特有菜单项，取消处于正在执行状态的当前结果表节点及其前置节点的执行操作</p>
    <p class="indent6">（4）查看数据：原表和结果表节点的菜单项，查看当前节点中的数据</p>
    <p class="indent6">（5）最终结果输出：结果表节点特有的菜单项，标记当前结果表的节点为最终结果输出节点，在保存模型时以此节点的SQL语句作为模型的SQL语句</p>
    <p class="indent6">（6）查看SQL语句：除自定义图形节点外的其他节点的菜单项，用以查看当前节点执行成功后的SQL语句</p>
    <%--<p class="indent6">（7）SQL编辑：SQL查询器特有的菜单项，用来辅助用户自定义编写SQL语句和实时查询数据</p>--%>
    <p class="indent6">（7）XXXX设置：所有操作节点的菜单项，可对当前的操作节点进行配置设置，包括了节点的基础信息配置、个性化的高级配置和部分节点具有的输出字段配置</p>
    <%--<p class="indent6">（8）重新配置：结果表节点特有的菜单项，重置结果表的配置信息</p>--%>
    <p class="indent6">（8）当前节点重命名：所有节点都具有的菜单项，对当前节点进行重命名</p>
    <p class="indent6">（9）复制当前节点：所有节点都具有的菜单项，复制一个空的当前节点，即不包含原节点的任何已有信息，包括执行信息和配置信息</p>
    <p class="indent6">（10）剪切当前节点：所有节点都具有的菜单项，剪切当前节点，但不包含当前节点的任何已有信息，包括执行信息和配置信息，该操作会影响与被剪切节点有关节点部分信息、执行状态及配置状态，且撤销操作后状态信息不可恢复</p>
    <p class="indent6">（11）删除当前节点：所有节点都具有的菜单项，删除当前节点，该操作会影响与被剪切节点有关节点部分信息、执行状态及配置状态，且撤销操作后状态信息不可恢复</p>
    <p class="indent4">6、连接线点击鼠标右键，出现右键菜单，包括：切换为直线、切换为曲线、删除当前节点</p>
    <p class="indent6">（1）切换为直线：将当前选中的连接线由曲线切换为直线</p>
    <p class="indent6">（2）切换为曲线：将当前选中的连接线由直线切换为曲线</p>
    <%--<p class="indent6">（3）重命名：重命名当前选中的连接线</p>--%>
    <p class="indent6">（3）删除当前节点：删除当前选中的连接线，该操作会影响与该节点有关的节点部分信息、执行状态及配置状态，且撤销操作后状态信息不可恢复</p>
    <p class="indent4">7、鼠标双击原表和结果表节点时，可查看当前节点中的数据，结果会在【信息提示区】的【数据结果集】区域展示</p>
    <p class="indent4">8、用户可通过键盘的【Alt】键+鼠标滚轮对工作区进行放大和缩小操作</p>
    <p class="indent4">9、当用户点击某个节点时，指向该节点的节点和连接线高亮显示,同时在右侧所使用资源区域的说明页签中显示当前节点的说明信息，当用户点击工作区空白区域时，若已有高亮显示的节点和线，则会取消高亮显示</p>
    <p>五、信息提示区</p>
    <p class="indent2">（一）介绍：该区域将图形化流程图中的结果信息展示给用户，包括数据结果集、执行结果、缩略图</p>
    <p class="indent2">（二）操作</p>
    <p class="indent4">1、数据结果集：当用户在【工作区】中的节点上进行右键【查看数据】操作、在资源列表区的节点上右键【预览数据】、双击原表和结果表时，会在此区域展示表数据</p>
    <p class="indent4">2、执行结果：当用户在【工作区】中的节点上进行右键【执行】操作后，该区域会展示此次的执行结果信息</p>
    <p class="indent4">3、缩略图：该区域实时展现给用户缩小版的图形化流程图，当设计的流程图超出【工作区】的区域时，用户可拖动蓝色框进行定位，也可拉伸、回缩蓝色框进行【工作区】图标的的放大和缩小</p>
    <p>六、所使用资源区</p>
    <p class="indent2">（一）介绍：该区域主要是记录设计整个图形化流程图的过程信息，包括说明、所使用资源、操作痕迹</p>
    <p class="indent2">（二）操作</p>
    <p class="indent4">1、说明：当用户点击工作区的节点时，会自动切换到【说明】页签，显示的内容是对该节点的简单说明</p>
    <p class="indent4">2、所使用资源：当用户每拖拽一个节点至工作区时，所使用资源树上就会多一个对应的节点，鼠标点击树节点时，在工作区对应的节点会被选中，且指向该节点的节点和连接线高亮显示</p>
    <p class="indent4">3、操作痕迹：</p>
    <p class="indent6">（1）记录用户在设计图形化流程图的过程中的所有操作，包括：打开图形化、拖拽节点、自动生成节点、配置节点、执行节点、重命名节点或连接线、切换连接线样式、剪切、删除、粘贴、撤销、还原</p>
    <p class="indent6">（2）当点击操作很急的树节点时，流程图会切换为该节点快照下的流程图，切换后不能通过撤销操作回退至原流程图，只能通过再次点击操作痕迹的树节点进行流程图切换</p>
  </div>
</template>

<script>
export default {
  name: 'Help'
}
</script>

<style scoped type="text/css">
    #remarkContent{
        width:100%;
        height:100%;
        padding:20px;
    }
    p{
        line-height: 1.8em;
        word-wrap: break-word;
    }
    p.indent2{
        text-indent: 2em;
    }
    p.indent4{
        text-indent: 4em;
    }
    p.indent6{
        text-indent: 6em;
    }
</style>
